       IDENTIFICATION DIVISION.
       PROGRAM-ID. read-write.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT INPUT-FILE ASSIGN TO './entrada.txt'
               ORGANIZATION IS LINE SEQUENTIAL.
           SELECT OUTPUT-FILE ASSIGN TO './salida.txt'
               ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
       FD INPUT-FILE.
       01 INPUT-RECORD PIC X(80).

       FD OUTPUT-FILE.
       01 OUTPUT-RECORD PIC X(80).

       WORKING-STORAGE SECTION.
       77 END-OF-FILE-FLAG PIC X VALUE 'N'.
          88 END-OF-FILE VALUE 'S'.
          88 NOT-END-OF-FILE VALUE 'N'.

       PROCEDURE DIVISION.
       BEGIN.
           OPEN INPUT INPUT-FILE
           OPEN OUTPUT OUTPUT-FILE

           PERFORM READ-FILE
           PERFORM PROCESS-RECORDS UNTIL END-OF-FILE

           CLOSE INPUT-FILE
           CLOSE OUTPUT-FILE

           DISPLAY "PROCESS COMPLETED."
           STOP RUN.

       READ-FILE.
           READ INPUT-FILE
               AT END SET END-OF-FILE TO TRUE
               NOT AT END SET NOT-END-OF-FILE TO TRUE
           END-READ.

       PROCESS-RECORDS.
           MOVE INPUT-RECORD TO OUTPUT-RECORD
           WRITE OUTPUT-RECORD
           PERFORM READ-FILE.
